backend/app/Models/HomeModel.php

public function getdatabyslug($slug =''){
    $builder = $this->db->table('ci_data');
    $query = $builder->select('*')
        ->where('slug', $slug)
        ->where('status', 1)
        ->where('deleted_by <=', 0)
        ->get();
---
SELECT *
FROM `ci_data`
WHERE `slug` = '/'
AND `status` = 1
AND `deleted_by` <= 0