backend/app/Helpers/custom_helper.php

    function url_redirections() {

        $db = \Config\Database::connect();
        $currentUrl = ($_SERVER['HTTPS'] ?? 'http') . '://' . $_SERVER['HTTP_HOST'] . $_SERVER['REQUEST_URI'];

        $redirection = $db->table('redirections')
            ->where('old_url', $currentUrl)
            ->where('status', 1)
            ->where('deleted_by <=', 0)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `redirections`
WHERE `old_url` = 'http://localhost/umair_rao/nz/'
AND `status` = 1
AND `deleted_by` <= 0